# Pandas

### Pandas is an open-source data analysis and manipulation library for Python that provides data structures like DataFrame and Series, along with a wide range of functions for data wrangling, cleaning, and analysis.

In [1]:
pip install pandas # installation of pandas

Note: you may need to restart the kernel to use updated packages.

ERROR: Invalid requirement: '#'

In [1]:
import pandas as pd #importing pandas

### series:a one-dimensional labeled array holding data of any type 
such as integers, strings, Python objects etc.

In [3]:
s = pd.Series([1, 3, 5, 6, 8])

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s1=pd.Series([1])

In [6]:
type(s1)

pandas.core.series.Series

## Data Frame

 A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.

In [7]:
df = pd.DataFrame(
    {
        "Name": [
            "Mr. Harris",
            "Mr.Ram",
            "Miss.Elizabeth",

        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [8]:
df

             Name  Age     Sex
0      Mr. Harris   22    male
1          Mr.Ram   35    male
2  Miss.Elizabeth   58  female

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
series2=df["Name"]

In [11]:
type(series2)

pandas.core.series.Series

### 1.Each column in a DataFrame is a Series

In [12]:
df.info() # info function gives us the basic information of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [13]:
df.describe() # describe function gives numerical metrics like mean,standard deviation etc.This function is only applicable on numerical columns.

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [14]:
df["Age"].max() # gives the maximum value

58

In [15]:
df['Age'].sum()

115

In [16]:
df['Name'].value_counts() # returns how many values does a particular name has

Name
Mr. Harris        1
Mr.Ram            1
Miss.Elizabeth    1
Name: count, dtype: int64

In [17]:
df.isnull().sum() # This method is used to find any null values in each row

Name    0
Age     0
Sex     0
dtype: int64

# REMEMBER

1.Import the package, aka import pandas as pd

2.A table of data is stored as a pandas DataFrame

3.Each column in a DataFrame is a Series

4.You can do things by applying a method to a DataFrame or Series

## Slicing and Indexing

In [18]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

In [19]:
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
type(series)

pandas.core.series.Series

In [21]:
series[2]

30

In [22]:
series[4]=5

In [23]:
series

0    10
1    20
2    30
3    40
4     5
dtype: int64

In [24]:
series[1:3]

1    20
2    30
dtype: int64

In [25]:
series[2:4]=[2,4]

In [26]:
series

0    10
1    20
2     2
3     4
4     5
dtype: int64

## lets us do it on Data Frames

In [27]:
data = [
    {'Name': 'Alice', 'Age': 24, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 27, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 22, 'City': 'Chicago'},
    {'Name': 'David', 'Age': 32, 'City': 'Houston'},
    {'Name': 'Eve', 'Age': 29, 'City': 'Phoenix'}
]

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eve   29      Phoenix

In [28]:
df[0]

KeyError: 0

In [29]:
df.loc[0]

Name       Alice
Age           24
City    New York
Name: 0, dtype: object

In [30]:
df.loc[0:1,0:2]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [31]:
df.iloc[0:1,0:2]

    Name  Age
0  Alice   24

In [32]:
df.iloc[0:1,0:2]=['Ram',34]

In [33]:
df

      Name  Age         City
0      Ram   34     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eve   29      Phoenix

In [34]:
df.iloc[0:2,2:]

          City
0     New York
1  Los Angeles

# REMEMBER

1.When selecting subsets of data, square brackets [] are used.

2.Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.

3.Select specific rows and/or columns using loc when using the row and column names.

4.Select specific rows and/or columns using iloc when using the positions in the table.

5.You can assign new values to a selection based on loc/iloc.

## some basic operations

In [38]:
numbers = pd.Series([10, 20, 30, 40, 50])

In [39]:
added_series = numbers + 10

In [41]:
added_series

0    20
1    30
2    40
3    50
4    60
dtype: int64

In [40]:
multiplied_series = numbers * 2

In [42]:
multiplied_series

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [43]:
sub_series=numbers - 2

In [44]:
sub_series

0     8
1    18
2    28
3    38
4    48
dtype: int64

In [45]:
even_numbers=added_series[(added_series)%2==0]

In [46]:
even_numbers

0    20
1    30
2    40
3    50
4    60
dtype: int64

In [47]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 23, 24],
    'Score': [85, 78, 90, 88, 76]
}

In [48]:
df=pd.DataFrame(data)

In [49]:
df

      Name  Age  Score
0    Alice   24     85
1      Bob   27     78
2  Charlie   22     90
3    David   23     88
4      Eve   24     76

In [50]:
name_column = df['Name']

In [51]:
name_column

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [52]:
high_scorers = df[df['Score'] > 80]

In [53]:
high_scorers

      Name  Age  Score
0    Alice   24     85
2  Charlie   22     90
3    David   23     88

In [54]:
df = df.drop(columns=['Age'])

In [55]:
df

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    David     88
4      Eve     76

In [56]:
average_score = df['Score'].mean()

In [57]:
average_score

83.4

In [58]:
df['Score'] += 5

In [59]:
df

      Name  Score
0    Alice     90
1      Bob     83
2  Charlie     95
3    David     93
4      Eve     81

# Questions

1) What is pandas? why we use it?
2) How to immport pandas?
3) what is series and dataframe?difference between them?
4) why loc and iloc used in pandas?
5) Name some functions we used in pandas?

# Excercise

-> create a data frame of emp_table consists of emp_name,role,salary,age(minimunm 10 rows).
-> find the avg salary of employees.
-> create table of employees who has salary more than 1 lakh.
-> increase the age +1 for every employee.
-> Group them by their roles.

# Advanced topics

In [60]:
df

      Name  Score
0    Alice     90
1      Bob     83
2  Charlie     95
3    David     93
4      Eve     81

In [61]:
sorted_students = df.sort_values(by='Score', ascending=False)

In [62]:
sorted_students

      Name  Score
2  Charlie     95
3    David     93
0    Alice     90
1      Bob     83
4      Eve     81

In [93]:
df['Passed'] = df['Score'] >= 90
df

      Name  Score  Passed
0    Alice     90    True
1      Bob     83   False
2  Charlie     95    True
3    David     93    True
4      Eve     81   False

In [88]:
 df.groupby('Passed').agg({'Score':'mean'})

            Score
Passed
False   82.000000
True    92.666667

In [94]:
extra_info = {
    'Name': ['Alice', 'David', 'Frank'],
    'Hobby': ['Reading', 'Swimming', 'Cycling']
}

In [95]:
extra_info = pd.DataFrame(extra_info)
merged_students = pd.merge(df, extra_info, on='Name', how='left')

In [96]:
merged_students

      Name  Score  Passed     Hobby
0    Alice     90    True   Reading
1      Bob     83   False       NaN
2  Charlie     95    True       NaN
3    David     93    True  Swimming
4      Eve     81   False       NaN

In [97]:
merged_students['Hobby'].fillna('Reading', inplace=True)

In [98]:
merged_students

      Name  Score  Passed     Hobby
0    Alice     90    True   Reading
1      Bob     83   False   Reading
2  Charlie     95    True   Reading
3    David     93    True  Swimming
4      Eve     81   False   Reading

In [ ]:
students.dropna(inplace=True)